Repository: iwmywn/personal-and-family-finance-app
Catalog: messages/*.po
Languages: ja_jp, ko_kr, vi_vn, zh_cn

# QWvB5t
source: Access denied! Please refresh the page and try again.
ja_jp: アクセスが拒否されました！ページを更新してもう一度お試しください。
ko_kr: 접근이 거부되었습니다! 페이지를 새로고침하고 다시 시도해주세요.
vi_vn: Truy cập bị từ chối! Vui lòng tải lại trang và thử lại.
zh_cn: 访问被拒绝！请刷新页面并重试。

# kwvIdb
source: This budget already exists!
ja_jp: この予算は既に存在します！
ko_kr: 이 예산이 이미 존재합니다!
vi_vn: Ngân sách này đã tồn tại!
zh_cn: 此预算已存在！

# ge/1ga
source: Failed to add budget! Please try again later.
ja_jp: 予算の追加に失敗しました！後でもう一度お試しください。
ko_kr: 예산 추가에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Thêm ngân sách thất bại! Vui lòng thử lại sau.
zh_cn: 添加预算失败！请稍后再试。

# hcutYI
source: Budget has been added.
ja_jp: 予算が追加されました。
ko_kr: 예산이 추가되었습니다.
vi_vn: Ngân sách đã được thêm.
zh_cn: 预算已添加。

# 3pMkv5
source: Invalid budget ID!
ja_jp: 予算IDが無効です！
ko_kr: 잘못된 예산 ID입니다!
vi_vn: ID ngân sách không hợp lệ!
zh_cn: 无效的预算 ID！

# 5BmD1W
source: Budget not found or you don't have permission to edit!
ja_jp: 予算が見つからないか、編集権限がありません！
ko_kr: 예산을 찾을 수 없거나 편집 권한이 없습니다!
vi_vn: Không tìm thấy ngân sách hoặc bạn không có quyền chỉnh sửa!
zh_cn: 未找到预算或您没有权限编辑！

# Ipw0W1
source: Budget has been updated.
ja_jp: 予算が更新されました。
ko_kr: 예산이 업데이트되었습니다.
vi_vn: Ngân sách đã được cập nhật.
zh_cn: 预算已更新。

# ZUfwUz
source: Failed to update budget! Please try again later.
ja_jp: 予算の更新に失敗しました！後でもう一度お試しください。
ko_kr: 예산 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật ngân sách thất bại! Vui lòng thử lại sau.
zh_cn: 更新预算失败！请稍后再试。

# fDrjqQ
source: Budget not found or you don't have permission to delete!
ja_jp: 予算が見つからないか、削除権限がありません！
ko_kr: 예산을 찾을 수 없거나 삭제 권한이 없습니다!
vi_vn: Không tìm thấy ngân sách hoặc bạn không có quyền xóa!
zh_cn: 未找到预算或您没有权限删除！

# GeSZei
source: Budget has been deleted.
ja_jp: 予算が削除されました。
ko_kr: 예산이 삭제되었습니다.
vi_vn: Ngân sách đã được xóa.
zh_cn: 预算已删除。

# niO8qC
source: Failed to delete budget! Please try again later.
ja_jp: 予算の削除に失敗しました！後でもう一度お試しください。
ko_kr: 예산 삭제에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xóa ngân sách thất bại! Vui lòng thử lại sau.
zh_cn: 删除预算失败！请稍后再试。

# xFeLWs
source: Failed to load budgets! Please try again later.
ja_jp: 予算の読み込みに失敗しました！後でもう一度お試しください。
ko_kr: 예산을 불러오는데 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tải danh sách ngân sách thất bại! Vui lòng thử lại sau.
zh_cn: 加载预算失败！请稍后再试。

# LzesyV
source: This category already exists!
ja_jp: このカテゴリは既に存在します！
ko_kr: 이 카테고리가 이미 존재합니다!
vi_vn: Danh mục này đã tồn tại!
zh_cn: 此分类已存在！

# G0Twr1
source: Error creating category key! Please try again later.
ja_jp: カテゴリキーの作成エラー！後でもう一度お試しください。
ko_kr: 카테고리 키 생성 오류! 나중에 다시 시도해주세요.
vi_vn: Lỗi khi tạo khóa danh mục! Vui lòng thử lại sau.
zh_cn: 创建分类键时出错！请稍后再试。

# OQ79b6
source: Failed to add category! Please try again later.
ja_jp: カテゴリの追加に失敗しました！後でもう一度お試しください。
ko_kr: 카테고리 추가에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Thêm danh mục thất bại! Vui lòng thử lại sau.
zh_cn: 添加分类失败！请稍后再试。

# Jfen4M
source: Category has been added.
ja_jp: カテゴリが追加されました。
ko_kr: 카테고리가 추가되었습니다.
vi_vn: Danh mục đã được thêm.
zh_cn: 分类已添加。

# TgxdcM
source: Invalid category ID!
ja_jp: カテゴリIDが無効です！
ko_kr: 잘못된 카테고리 ID입니다!
vi_vn: ID danh mục không hợp lệ!
zh_cn: 无效的分类 ID！

# Jau5xo
source: Category not found or you don't have permission to edit!
ja_jp: カテゴリが見つからないか、編集権限がありません！
ko_kr: 카테고리를 찾을 수 없거나 편집 권한이 없습니다!
vi_vn: Không tìm thấy danh mục hoặc bạn không có quyền chỉnh sửa!
zh_cn: 未找到分类或您没有权限编辑！

# RMEY96
source: Category has been updated.
ja_jp: カテゴリが更新されました。
ko_kr: 카테고리가 업데이트되었습니다.
vi_vn: Danh mục đã được cập nhật.
zh_cn: 分类已更新。

# PoUgbk
source: Failed to update category! Please try again later.
ja_jp: カテゴリの更新に失敗しました！後でもう一度お試しください。
ko_kr: 카테고리 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật danh mục thất bại! Vui lòng thử lại sau.
zh_cn: 更新分类失败！请稍后再试。

# IzwrSe
source: Category not found or you don't have permission to delete!
ja_jp: カテゴリが見つからないか、削除権限がありません！
ko_kr: 카테고리를 찾을 수 없거나 삭제 권한이 없습니다!
vi_vn: Không tìm thấy danh mục hoặc bạn không có quyền xóa!
zh_cn: 未找到分类或您没有权限删除！

# SyYZuO
source: Cannot delete category. There are {count} transactions using this category. Please delete those transactions first.
ja_jp: カテゴリを削除できません。このカテゴリを使用している取引が{count}個あります。まずそれらの取引を削除してください。
ko_kr: 카테고리를 삭제할 수 없습니다. 이 카테고리를 사용하는 거래가 {count}개 있습니다. 먼저 해당 거래를 삭제해주세요.
vi_vn: Không thể xóa danh mục. Có {count} giao dịch đang sử dụng danh mục này. Vui lòng xóa các giao dịch đó trước.
zh_cn: 无法删除分类。有 {count} 个交易正在使用此分类。请先删除这些交易。

# iNZspt
source: Cannot delete category. There are {count} budgets using this category. Please delete those budgets first.
ja_jp: カテゴリを削除できません。このカテゴリを使用している予算が{count}個あります。まずそれらの予算を削除してください。
ko_kr: 카테고리를 삭제할 수 없습니다. 이 카테고리를 사용하는 예산이 {count}개 있습니다. 먼저 해당 예산을 삭제해주세요.
vi_vn: Không thể xóa danh mục. Có {count} ngân sách đang sử dụng danh mục này. Vui lòng xóa các ngân sách đó trước.
zh_cn: 无法删除分类。有 {count} 个预算正在使用此分类。请先删除这些预算。

# C7NEmI
source: Cannot delete category. There are {count} goals using this category. Please delete those goals first.
ja_jp: カテゴリを削除できません。このカテゴリを使用している目標が{count}個あります。まずそれらの目標を削除してください。
ko_kr: 카테고리를 삭제할 수 없습니다. 이 카테고리를 사용하는 목표가 {count}개 있습니다. 먼저 해당 목표를 삭제해주세요.
vi_vn: Không thể xóa danh mục. Có {count} mục tiêu đang sử dụng danh mục này. Vui lòng xóa các mục tiêu đó trước.
zh_cn: 无法删除分类。有 {count} 个目标正在使用此分类。请先删除这些目标。

# Q/Y/ED
source: Cannot delete category. There are {count} recurring transactions using this category. Please delete those recurring transactions first.
ja_jp: カテゴリを削除できません。このカテゴリを使用している定期取引が{count}個あります。まずそれらの定期取引を削除してください。
ko_kr: 카테고리를 삭제할 수 없습니다. 이 카테고리를 사용하는 반복 거래가 {count}개 있습니다. 먼저 해당 반복 거래를 삭제해주세요.
vi_vn: Không thể xóa danh mục. Có {count} giao dịch định kỳ đang sử dụng danh mục này. Vui lòng xóa các giao dịch định kỳ đó trước.
zh_cn: 无法删除分类。有 {count} 个定期交易正在使用此分类。请先删除这些定期交易。

# 7Al4tw
source: Category has been deleted.
ja_jp: カテゴリが削除されました。
ko_kr: 카테고리가 삭제되었습니다.
vi_vn: Danh mục đã được xóa.
zh_cn: 分类已删除。

# XWfgXI
source: Failed to delete category! Please try again later.
ja_jp: カテゴリの削除に失敗しました！後でもう一度お試しください。
ko_kr: 카테고리 삭제에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xóa danh mục thất bại! Vui lòng thử lại sau.
zh_cn: 删除分类失败！请稍后再试。

# gzfdvr
source: Failed to load custom categories! Please try again later.
ja_jp: カスタムカテゴリの読み込みに失敗しました！後でもう一度お試しください。
ko_kr: 사용자 정의 카테고리를 불러오는데 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tải danh mục tùy chỉnh thất bại! Vui lòng thử lại sau.
zh_cn: 加载自定义分类失败！请稍后再试。

# 3SCa/T
source: This goal already exists!
ja_jp: この目標は既に存在します！
ko_kr: 이 목표가 이미 존재합니다!
vi_vn: Mục tiêu này đã tồn tại!
zh_cn: 此目标已存在！

# 9Buhj/
source: Failed to add goal! Please try again later.
ja_jp: 目標の追加に失敗しました！後でもう一度お試しください。
ko_kr: 목표 추가에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Thêm mục tiêu thất bại! Vui lòng thử lại sau.
zh_cn: 添加目标失败！请稍后再试。

# J+nrjG
source: Goal has been added.
ja_jp: 目標が追加されました。
ko_kr: 목표가 추가되었습니다.
vi_vn: Mục tiêu đã được thêm.
zh_cn: 目标已添加。

# 7UB8uM
source: Invalid goal ID!
ja_jp: 目標IDが無効です！
ko_kr: 잘못된 목표 ID입니다!
vi_vn: ID mục tiêu không hợp lệ!
zh_cn: 无效的目标 ID！

# iQpYZg
source: Goal not found or you don't have permission to edit!
ja_jp: 目標が見つからないか、編集権限がありません！
ko_kr: 목표를 찾을 수 없거나 편집 권한이 없습니다!
vi_vn: Không tìm thấy mục tiêu hoặc bạn không có quyền chỉnh sửa!
zh_cn: 未找到目标或您没有权限编辑！

# SpmGQk
source: Goal has been updated.
ja_jp: 目標が更新されました。
ko_kr: 목표가 업데이트되었습니다.
vi_vn: Mục tiêu đã được cập nhật.
zh_cn: 目标已更新。

# Lmu8yS
source: Failed to update goal! Please try again later.
ja_jp: 目標の更新に失敗しました！後でもう一度お試しください。
ko_kr: 목표 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật mục tiêu thất bại! Vui lòng thử lại sau.
zh_cn: 更新目标失败！请稍后再试。

# Av4WTA
source: Goal not found or you don't have permission to delete!
ja_jp: 目標が見つからないか、削除権限がありません！
ko_kr: 목표를 찾을 수 없거나 삭제 권한이 없습니다!
vi_vn: Không tìm thấy mục tiêu hoặc bạn không có quyền xóa!
zh_cn: 未找到目标或您没有权限删除！

# MT417I
source: Goal has been deleted.
ja_jp: 目標が削除されました。
ko_kr: 목표가 삭제되었습니다.
vi_vn: Mục tiêu đã được xóa.
zh_cn: 目标已删除。

# uwewg6
source: Failed to delete goal! Please try again later.
ja_jp: 目標の削除に失敗しました！後でもう一度お試しください。
ko_kr: 목표 삭제에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xóa mục tiêu thất bại! Vui lòng thử lại sau.
zh_cn: 删除目标失败！请稍后再试。

# xwvGbl
source: Failed to load goals! Please try again later.
ja_jp: 目標の読み込みに失敗しました！後でもう一度お試しください。
ko_kr: 목표를 불러오는데 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tải danh sách mục tiêu thất bại! Vui lòng thử lại sau.
zh_cn: 加载目标失败！请稍后再试。

# +HBMWc
source: This recurring transaction already exists!
ja_jp: この定期取引は既に存在します！
ko_kr: 이 반복 거래가 이미 존재합니다!
vi_vn: Giao dịch định kỳ này đã tồn tại!
zh_cn: 此定期交易已存在！

# FLPmpu
source: Failed to add recurring transaction! Please try again later.
ja_jp: 定期取引の追加に失敗しました！後でもう一度お試しください。
ko_kr: 반복 거래 추가에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Thêm giao dịch định kỳ thất bại! Vui lòng thử lại sau.
zh_cn: 添加定期交易失败！请稍后再试。

# 5Mtoe5
source: Recurring transaction has been added.
ja_jp: 定期取引が追加されました。
ko_kr: 반복 거래가 추가되었습니다.
vi_vn: Giao dịch định kỳ đã được thêm.
zh_cn: 定期交易已添加。

# Yamhgo
source: Invalid recurring transaction ID!
ja_jp: 定期取引IDが無効です！
ko_kr: 잘못된 반복 거래 ID입니다!
vi_vn: ID giao dịch định kỳ không hợp lệ!
zh_cn: 无效的定期交易 ID！

# oyoqPq
source: Recurring transaction not found or you don't have permission to edit.
ja_jp: 定期取引が見つからないか、編集権限がありません。
ko_kr: 반복 거래를 찾을 수 없거나 편집 권한이 없습니다.
vi_vn: Không tìm thấy giao dịch định kỳ hoặc bạn không có quyền chỉnh sửa.
zh_cn: 未找到定期交易或您没有权限编辑。

# FgrcGc
source: Recurring transaction has been updated.
ja_jp: 定期取引が更新されました。
ko_kr: 반복 거래가 업데이트되었습니다.
vi_vn: Giao dịch định kỳ đã được cập nhật.
zh_cn: 定期交易已更新。

# qlYMTi
source: Failed to update recurring transaction! Please try again later.
ja_jp: 定期取引の更新に失敗しました！後でもう一度お試しください。
ko_kr: 반복 거래 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật giao dịch định kỳ thất bại! Vui lòng thử lại sau.
zh_cn: 更新定期交易失败！请稍后再试。

# TJXAsr
source: Recurring transaction not found or you don't have permission to delete!
ja_jp: 定期取引が見つからないか、削除権限がありません！
ko_kr: 반복 거래를 찾을 수 없거나 삭제 권한이 없습니다!
vi_vn: Không tìm thấy giao dịch định kỳ hoặc bạn không có quyền xóa!
zh_cn: 未找到定期交易或您没有权限删除！

# 0L6Kzl
source: Recurring transaction has been deleted.
ja_jp: 定期取引が削除されました。
ko_kr: 반복 거래가 삭제되었습니다.
vi_vn: Giao dịch định kỳ đã được xóa.
zh_cn: 定期交易已删除。

# 9p5fYg
source: Failed to delete recurring transaction! Please try again later.
ja_jp: 定期取引の削除に失敗しました！後でもう一度お試しください。
ko_kr: 반복 거래 삭제에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xóa giao dịch định kỳ thất bại! Vui lòng thử lại sau.
zh_cn: 删除定期交易失败！请稍后再试。

# D92YlY
source: Failed to load recurring transactions! Please try again later.
ja_jp: 定期取引の読み込みに失敗しました！後でもう一度お試しください。
ko_kr: 반복 거래를 불러오는데 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tải danh sách giao dịch định kỳ thất bại! Vui lòng thử lại sau.
zh_cn: 加载定期交易失败！请稍后再试。

# v+aP8j
source: This transaction has already been created today!
ja_jp: この取引は既に今日作成されています！
ko_kr: 이 거래는 오늘 이미 생성되었습니다!
vi_vn: Giao dịch này đã được tạo hôm nay!
zh_cn: 今天已创建此交易！

# zb35o3
source: Failed to add transaction! Please try again later.
ja_jp: 取引の追加に失敗しました！後でもう一度お試しください。
ko_kr: 거래 추가에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Thêm giao dịch thất bại! Vui lòng thử lại sau.
zh_cn: 添加交易失败！请稍后再试。

# pU1r4y
source: Transaction has been added.
ja_jp: 取引が追加されました。
ko_kr: 거래가 추가되었습니다.
vi_vn: Giao dịch đã được thêm.
zh_cn: 交易已添加。

# w/J6M7
source: Invalid transaction ID!
ja_jp: 取引IDが無効です！
ko_kr: 잘못된 거래 ID입니다!
vi_vn: ID giao dịch không hợp lệ!
zh_cn: 无效的交易 ID！

# qyC85x
source: Transaction not found or you don't have permission to edit!
ja_jp: 取引が見つからないか、編集権限がありません！
ko_kr: 거래를 찾을 수 없거나 편집 권한이 없습니다!
vi_vn: Không tìm thấy giao dịch hoặc bạn không có quyền chỉnh sửa!
zh_cn: 未找到交易或您没有权限编辑！

# VHOeqA
source: Transaction has been updated.
ja_jp: 取引が更新されました。
ko_kr: 거래가 업데이트되었습니다.
vi_vn: Giao dịch đã được cập nhật.
zh_cn: 交易已更新。

# A9rBEo
source: Failed to update transaction! Please try again later.
ja_jp: 取引の更新に失敗しました！後でもう一度お試しください。
ko_kr: 거래 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật giao dịch thất bại! Vui lòng thử lại sau.
zh_cn: 更新交易失败！请稍后再试。

# Fxn2/P
source: Transaction not found or you don't have permission to delete!
ja_jp: 取引が見つからないか、削除権限がありません！
ko_kr: 거래를 찾을 수 없거나 삭제 권한이 없습니다!
vi_vn: Không tìm thấy giao dịch hoặc bạn không có quyền xóa!
zh_cn: 未找到交易或您没有权限删除！

# tz6kfd
source: Transaction has been deleted.
ja_jp: 取引が削除されました。
ko_kr: 거래가 삭제되었습니다.
vi_vn: Giao dịch đã được xóa.
zh_cn: 交易已删除。

# DcqDur
source: Failed to delete transaction! Please try again later.
ja_jp: 取引の削除に失敗しました！後でもう一度お試しください。
ko_kr: 거래 삭제에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xóa giao dịch thất bại! Vui lòng thử lại sau.
zh_cn: 删除交易失败！请稍后再试。

# +VVz7r
source: Failed to load transactions! Please try again later.
ja_jp: 取引の読み込みに失敗しました！後でもう一度お試しください。
ko_kr: 거래를 불러오는데 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tải danh sách giao dịch thất bại! Vui lòng thử lại sau.
zh_cn: 加载交易失败！请稍后再试。

# Ub+AGc
source: Sign In
ja_jp: サインイン
ko_kr: 로그인
vi_vn: Đăng nhập
zh_cn: 登录

# gvGdmL
source: Enter your username and password to sign in to your account.
ja_jp: アカウントにサインインするには、ユーザー名とパスワードを入力してください。
ko_kr: 계정에 로그인하려면 사용자 이름과 비밀번호를 입력하세요.
vi_vn: Nhập tên đăng nhập và mật khẩu để đăng nhập vào tài khoản của bạn.
zh_cn: 输入您的用户名和密码以登录您的帐户。

# AJyYQz
source: Two-Factor Authentication
ja_jp: 二要素認証
ko_kr: 2단계 인증
vi_vn: Xác thực hai yếu tố
zh_cn: 双重身份验证

# PsYaj1
source: Enter the code from your authenticator app.
ja_jp: 認証アプリからコードを入力してください。
ko_kr: 인증 앱의 코드를 입력하세요.
vi_vn: Nhập mã từ ứng dụng xác thực của bạn.
zh_cn: 输入您的身份验证器应用中的代码。

# k1s9UW
source: Not Found
ja_jp: 見つかりません
ko_kr: 찾을 수 없음
vi_vn: Không tìm thấy
zh_cn: 未找到

# QRccCM
source: Page not found
ja_jp: ページが見つかりません
ko_kr: 페이지를 찾을 수 없습니다
vi_vn: Trang không tìm thấy
zh_cn: 页面未找到

# yAbaof
source: The page you are looking for does not exist.
ja_jp: お探しのページは存在しません。
ko_kr: 찾고 계신 페이지가 존재하지 않습니다.
vi_vn: Trang bạn đang tìm kiếm không tồn tại.
zh_cn: 您正在查找的页面不存在。

# kfoc7z
source: Back to Home
ja_jp: ホームに戻る
ko_kr: 홈으로 돌아가기
vi_vn: Về trang chủ
zh_cn: 返回首页

# mJeXSX
source: Budgets
ja_jp: 予算
ko_kr: 예산
vi_vn: Ngân sách
zh_cn: 预算

# VKb1MS
source: Categories
ja_jp: カテゴリ
ko_kr: 카테고리
vi_vn: Danh mục
zh_cn: 分类

# XHLYdJ
source: Goals
ja_jp: 目標
ko_kr: 목표
vi_vn: Mục tiêu
zh_cn: 目标

# ejEGdx
source: Home
ja_jp: ホーム
ko_kr: 홈
vi_vn: Trang chủ
zh_cn: 首页

# iKuJb1
source: CANNOT FETCH TRANSACTIONS DATA
ja_jp: 取引データを取得できません
ko_kr: 거래 데이터를 가져올 수 없습니다
vi_vn: KHÔNG THỂ TẢI DỮ LIỆU GIAO DỊCH
zh_cn: 无法获取交易数据

# pvUtk6
source: CANNOT FETCH CATEGORIES DATA
ja_jp: カテゴリデータを取得できません
ko_kr: 카테고리 데이터를 가져올 수 없습니다
vi_vn: KHÔNG THỂ TẢI DỮ LIỆU DANH MỤC
zh_cn: 无法获取分类数据

# iriWHm
source: CANNOT FETCH BUDGETS DATA
ja_jp: 予算データを取得できません
ko_kr: 예산 데이터를 가져올 수 없습니다
vi_vn: KHÔNG THỂ TẢI DỮ LIỆU NGÂN SÁCH
zh_cn: 无法获取预算数据

# V9Jq49
source: CANNOT FETCH GOALS DATA
ja_jp: 目標データを取得できません
ko_kr: 목표 데이터를 가져올 수 없습니다
vi_vn: KHÔNG THỂ TẢI DỮ LIỆU MỤC TIÊU
zh_cn: 无法获取目标数据

# 3aju6V
source: CANNOT FETCH RECURRING TRANSACTIONS DATA
ja_jp: 定期取引データを取得できません
ko_kr: 반복 거래 데이터를 가져올 수 없습니다
vi_vn: KHÔNG THỂ TẢI DỮ LIỆU GIAO DỊCH ĐỊNH KỲ
zh_cn: 无法获取定期交易数据

# VgzOzy
source: Recurring Transactions
ja_jp: 定期取引
ko_kr: 반복 거래
vi_vn: Giao dịch định kỳ
zh_cn: 定期交易

# D3idYv
source: Settings
ja_jp: 設定
ko_kr: 설정
vi_vn: Cài đặt
zh_cn: 设置

# H3eDAS
source: Statistics
ja_jp: 統計
ko_kr: 통계
vi_vn: Thống kê
zh_cn: 统计

# /jJLYy
source: Transactions
ja_jp: 取引
ko_kr: 거래
vi_vn: Giao dịch
zh_cn: 交易

# /WMCDd
source: Something went wrong!
ja_jp: 問題が発生しました！
ko_kr: 문제가 발생했습니다!
vi_vn: Đã xảy ra lỗi!
zh_cn: 出了点问题！

# hyu/OZ
source: Personal & Family Finance App
ja_jp: 個人・家族向け財務アプリ
ko_kr: 개인 및 가족 재정 앱
vi_vn: Ứng dụng Tài chính Cá nhân & Gia đình
zh_cn: 个人和家庭财务应用

# ExP2LI
source: CAPTCHA verification failed! Please try again later.
ja_jp: CAPTCHA認証に失敗しました！後でもう一度お試しください。
ko_kr: CAPTCHA 인증에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xác minh CAPTCHA thất bại! Vui lòng thử lại sau.
zh_cn: 验证码验证失败！请稍后再试。

# E4J/N3
source: Please complete CAPTCHA verification!
ja_jp: CAPTCHA認証を完了してください！
ko_kr: CAPTCHA 인증을 완료해주세요!
vi_vn: Vui lòng hoàn thành xác minh CAPTCHA!
zh_cn: 请完成验证码验证！

# ItmvCq
source: CAPTCHA Verification
ja_jp: CAPTCHA認証
ko_kr: CAPTCHA 인증
vi_vn: Xác minh CAPTCHA
zh_cn: 验证码验证

# 5GmpFA
source: Invalid data!
ja_jp: 無効なデータです！
ko_kr: 잘못된 데이터입니다!
vi_vn: Dữ liệu không hợp lệ!
zh_cn: 无效数据！

# pxIiYc
source: Invalid username or password!
ja_jp: ユーザー名またはパスワードが無効です！
ko_kr: 잘못된 사용자 이름 또는 비밀번호입니다!
vi_vn: Tên đăng nhập hoặc mật khẩu không hợp lệ!
zh_cn: 用户名或密码无效！

# b8+mgZ
source: Failed to sign in! Please try again later.
ja_jp: サインインに失敗しました！後でもう一度お試しください。
ko_kr: 로그인에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Đăng nhập thất bại! Vui lòng thử lại sau.
zh_cn: 登录失败！请稍后再试。

# JCIgkj
source: Username
ja_jp: ユーザー名
ko_kr: 사용자 이름
vi_vn: Tên đăng nhập
zh_cn: 用户名

# 5sg7KC
source: Password
ja_jp: パスワード
ko_kr: 비밀번호
vi_vn: Mật khẩu
zh_cn: 密码

# mXmfR7
source: Invalid authentication code! Please try again later.
ja_jp: 認証コードが無効です！後でもう一度お試しください。
ko_kr: 잘못된 인증 코드입니다! 나중에 다시 시도해주세요.
vi_vn: Mã xác thực không hợp lệ! Vui lòng thử lại sau.
zh_cn: 验证码无效！请稍后再试。

# Tjv3UC
source: Verification Code
ja_jp: 確認コード
ko_kr: 인증 코드
vi_vn: Mã xác minh
zh_cn: 验证码

# hyw/Cv
source: Trust this device
ja_jp: このデバイスを信頼する
ko_kr: 이 기기 신뢰하기
vi_vn: Tin cậy thiết bị này
zh_cn: 信任此设备

# ZcMAT1
source: Don't ask for 2FA code on this device for 30 days.
ja_jp: このデバイスでは30日間2FAコードを要求しない。
ko_kr: 이 기기에서 30일 동안 2FA 코드를 묻지 않기.
vi_vn: Không hỏi mã 2FA trên thiết bị này trong 30 ngày.
zh_cn: 30 天内不再在此设备上询问 2FA 代码。

# q5Xl0M
source: Verify
ja_jp: 確認
ko_kr: 확인
vi_vn: Xác minh
zh_cn: 验证

# 2g82CP
source: Edit Budget
ja_jp: 予算を編集
ko_kr: 예산 편집
vi_vn: Chỉnh sửa ngân sách
zh_cn: 编辑预算

# zMoeFN
source: Add Budget
ja_jp: 予算を追加
ko_kr: 예산 추가
vi_vn: Thêm ngân sách
zh_cn: 添加预算

# zSiCkT
source: Update budget information.
ja_jp: 予算情報を更新します。
ko_kr: 예산 정보를 업데이트하세요.
vi_vn: Cập nhật thông tin ngân sách.
zh_cn: 更新预算信息。

# PVSBse
source: Create a budget for a category to track your spending.
ja_jp: 支出を追跡するために、カテゴリの予算を作成します。
ko_kr: 지출을 추적하기 위해 카테고리에 대한 예산을 만드세요.
vi_vn: Tạo ngân sách cho một danh mục để theo dõi chi tiêu của bạn.
zh_cn: 为分类创建预算以跟踪您的支出。

# 55hdQy
source: Currency
ja_jp: 通貨
ko_kr: 통화
vi_vn: Tiền tệ
zh_cn: 货币

# /0TOL5
source: Amount
ja_jp: 金額
ko_kr: 금액
vi_vn: Số tiền
zh_cn: 金额

# QirE3M
source: Start Date
ja_jp: 開始日
ko_kr: 시작일
vi_vn: Ngày bắt đầu
zh_cn: 开始日期

# ftg7GK
source: Select Date
ja_jp: 日付を選択
ko_kr: 날짜 선택
vi_vn: Chọn ngày
zh_cn: 选择日期

# T4GOiX
source: End Date
ja_jp: 終了日
ko_kr: 종료일
vi_vn: Ngày kết thúc
zh_cn: 结束日期

# 47FYwb
source: Cancel
ja_jp: キャンセル
ko_kr: 취소
vi_vn: Hủy
zh_cn: 取消

# BWpuKl
source: Update
ja_jp: 更新
ko_kr: 업데이트
vi_vn: Cập nhật
zh_cn: 更新

# 2/2yg+
source: Add
ja_jp: 追加
ko_kr: 추가
vi_vn: Thêm
zh_cn: 添加

# TBovrx
source: Month
ja_jp: 月
ko_kr: 월
vi_vn: Tháng
zh_cn: 月份

# O+ZfC8
source: All Months
ja_jp: すべての月
ko_kr: 모든 월
vi_vn: Tất cả các tháng
zh_cn: 所有月份

# IFo1oo
source: Year
ja_jp: 年
ko_kr: 연도
vi_vn: Năm
zh_cn: 年份

# 5JGC4V
source: All Years
ja_jp: すべての年
ko_kr: 모든 연도
vi_vn: Tất cả các năm
zh_cn: 所有年份

# ccXLVi
source: Category
ja_jp: カテゴリ
ko_kr: 카테고리
vi_vn: Danh mục
zh_cn: 分类

# 1X6HtI
source: All Categories
ja_jp: すべてのカテゴリ
ko_kr: 모든 카테고리
vi_vn: Tất cả danh mục
zh_cn: 所有分类

# sIMS7i
source: Progress
ja_jp: 進捗
ko_kr: 진행률
vi_vn: Tiến độ
zh_cn: 进度

# W8OX/r
source: All Progress
ja_jp: すべての進捗
ko_kr: 모든 진행률
vi_vn: Tất cả tiến độ
zh_cn: 所有进度

# tlzCDY
source: No Transactions
ja_jp: 取引なし
ko_kr: 거래 없음
vi_vn: Không có giao dịch
zh_cn: 无交易

# ZLbolA
source: Good (< 75%)
ja_jp: 良好（< 75%）
ko_kr: 양호 (< 75%)
vi_vn: Tốt (< 75%)
zh_cn: 良好 (< 75%)

# 1TM0t6
source: Warning (75-100%)
ja_jp: 警告（75-100%）
ko_kr: 경고 (75-100%)
vi_vn: Cảnh báo (75-100%)
zh_cn: 警告 (75-100%)

# DSmOlH
source: Exceeded (≥ 100%)
ja_jp: 超過（≥ 100%）
ko_kr: 초과 (≥ 100%)
vi_vn: Vượt quá (≥ 100%)
zh_cn: 超出 (≥ 100%)

# tzMNF3
source: Status
ja_jp: ステータス
ko_kr: 상태
vi_vn: Trạng thái
zh_cn: 状态

# tADQQm
source: All Statuses
ja_jp: すべてのステータス
ko_kr: 모든 상태
vi_vn: Tất cả trạng thái
zh_cn: 所有状态

# RahCRH
source: Expired
ja_jp: 期限切れ
ko_kr: 만료됨
vi_vn: Đã hết hạn
zh_cn: 已过期

# 3a5wL8
source: Active
ja_jp: アクティブ
ko_kr: 활성
vi_vn: Đang hoạt động
zh_cn: 活跃

# 6/aEFZ
source: Upcoming
ja_jp: 予定
ko_kr: 예정됨
vi_vn: Sắp tới
zh_cn: 即将到来

# jm/spn
source: Reset
ja_jp: リセット
ko_kr: 초기화
vi_vn: Đặt lại
zh_cn: 重置

# UxaXqH
source: Set and manage budgets for your expense categories.
ja_jp: 支出カテゴリの予算を設定して管理します。
ko_kr: 지출 카테고리에 대한 예산을 설정하고 관리하세요.
vi_vn: Thiết lập và quản lý ngân sách cho các danh mục chi tiêu của bạn.
zh_cn: 设置和管理您的支出分类预算。

# 6HxSkI
source: No budgets yet
ko_kr: 아직 예산이 없습니다
zh_cn: 暂无预算

# XYhPPe
source: You haven't created any budgets yet. Add your first budget!
ko_kr: 아직 예산을 만들지 않았습니다. 첫 번째 예산을 추가하세요!
zh_cn: 您尚未创建任何预算。添加您的第一个预算！

# PZ97Zd
source: No budgets found matching your filters.
ja_jp: フィルターに一致する予算が見つかりませんでした。
ko_kr: 필터와 일치하는 예산을 찾을 수 없습니다.
vi_vn: Không tìm thấy ngân sách phù hợp với bộ lọc của bạn.
zh_cn: 未找到符合筛选条件的预算。

# 111qQK
source: Spent
ja_jp: 支出額
ko_kr: 지출
vi_vn: Đã chi
zh_cn: 已支出

# H5+NAX
source: Balance
ja_jp: 残高
ko_kr: 잔액
vi_vn: Số dư
zh_cn: 余额

# bdcMGy
source: Open menu
ja_jp: メニューを開く
ko_kr: 메뉴 열기
vi_vn: Mở menu
zh_cn: 打开菜单

# wEQDC6
source: Edit
ja_jp: 編集
ko_kr: 편집
vi_vn: Chỉnh sửa
zh_cn: 编辑

# K3r6DQ
source: Delete
ja_jp: 削除
ko_kr: 삭제
vi_vn: Xóa
zh_cn: 删除

# q6vl7b
source: Delete Budget
ja_jp: 予算を削除
ko_kr: 예산 삭제
vi_vn: Xóa ngân sách
zh_cn: 删除预算

# x1Tqbe
source: Are you sure you want to delete this budget? This action cannot be undone.
ja_jp: この予算を削除してもよろしいですか？この操作は元に戻せません。
ko_kr: 이 예산을 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
vi_vn: Bạn có chắc chắn muốn xóa ngân sách này không? Hành động này không thể hoàn tác.
zh_cn: 您确定要删除此预算吗？此操作无法撤销。

# 5reIsh
source: Manage your custom categories.
ja_jp: カスタムカテゴリを管理します。
ko_kr: 사용자 정의 카테고리를 관리하세요.
vi_vn: Quản lý các danh mục tùy chỉnh của bạn.
zh_cn: 管理您的自定义分类。

# dM86a2
source: No categories found
ja_jp: カテゴリが見つかりません
ko_kr: 카테고리를 찾을 수 없습니다
vi_vn: Không tìm thấy danh mục
zh_cn: 未找到分类

# 7vjOuF
source: You haven't created any custom categories yet.
ja_jp: まだカスタムカテゴリを作成していません。
ko_kr: 아직 사용자 정의 카테고리를 만들지 않았습니다.
vi_vn: Bạn chưa tạo danh mục tùy chỉnh nào.
zh_cn: 您尚未创建任何自定义分类。

# Dojtt1
source: No categories found matching your filters.
ja_jp: フィルターに一致するカテゴリが見つかりませんでした。
ko_kr: 필터와 일치하는 카테고리를 찾을 수 없습니다.
vi_vn: Không tìm thấy danh mục phù hợp với bộ lọc của bạn.
zh_cn: 未找到符合筛选条件的分类。

# vEYtiq
source: Category Name
ja_jp: カテゴリ名
ko_kr: 카테고리 이름
vi_vn: Tên danh mục
zh_cn: 分类名称

# Q8Qw5B
source: Description
ja_jp: 説明
ko_kr: 설명
vi_vn: Mô tả
zh_cn: 描述

# +U6ozc
source: Type
ja_jp: タイプ
ko_kr: 유형
vi_vn: Loại
zh_cn: 类型

# gJkHZk
source: Income
ja_jp: 収入
ko_kr: 수입
vi_vn: Thu nhập
zh_cn: 收入

# URe+qA
source: Expense
ja_jp: 支出
ko_kr: 지출
vi_vn: Chi tiêu
zh_cn: 支出

# THThZY
source: Edit Category
ja_jp: カテゴリを編集
ko_kr: 카테고리 편집
vi_vn: Chỉnh sửa danh mục
zh_cn: 编辑分类

# 5Fs4aA
source: Add Category
ja_jp: カテゴリを追加
ko_kr: 카테고리 추가
vi_vn: Thêm danh mục
zh_cn: 添加分类

# 1VRDDQ
source: Update custom category information.
ja_jp: カスタムカテゴリ情報を更新します。
ko_kr: 사용자 정의 카테고리 정보를 업데이트하세요.
vi_vn: Cập nhật thông tin danh mục tùy chỉnh.
zh_cn: 更新自定义分类信息。

# 0jMR1h
source: Create a custom category for your transactions.
ja_jp: 取引用のカスタムカテゴリを作成します。
ko_kr: 거래를 위한 사용자 정의 카테고리를 만드세요.
vi_vn: Tạo danh mục tùy chỉnh cho các giao dịch của bạn.
zh_cn: 为您的交易创建自定义分类。

# TxCpcX
source: e.g. Salary, Groceries
ja_jp: 例：給与、食料品
ko_kr: 예: 급여, 식료품
vi_vn: ví dụ: Lương, Mua sắm
zh_cn: 例如：工资、杂货

# s0F42g
source: Enter a description...
ja_jp: 説明を入力...
ko_kr: 설명을 입력하세요...
vi_vn: Nhập mô tả...
zh_cn: 输入描述...

# T83iU7
source: Search categories...
ja_jp: カテゴリを検索...
ko_kr: 카테고리 검색...
vi_vn: Tìm kiếm danh mục...
zh_cn: 搜索分类...

# UjTL+F
source: All Types
ja_jp: すべてのタイプ
ko_kr: 모든 유형
vi_vn: Tất cả các loại
zh_cn: 所有类型

# JtR9Fg
source: Delete Category
ja_jp: カテゴリを削除
ko_kr: 카테고리 삭제
vi_vn: Xóa danh mục
zh_cn: 删除分类

# qjLKlD
source: Are you sure you want to delete this category? This action cannot be undone.
ja_jp: このカテゴリを削除してもよろしいですか？この操作は元に戻せません。
ko_kr: 이 카테고리를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
vi_vn: Bạn có chắc chắn muốn xóa danh mục này không? Hành động này không thể hoàn tác.
zh_cn: 您确定要删除此分类吗？此操作无法撤销。

# IkXLzZ
source: Select Category
ja_jp: カテゴリを選択
ko_kr: 카테고리 선택
vi_vn: Chọn danh mục
zh_cn: 选择分类
