Repository: iwmywn/personal-and-family-finance-app
Catalog: messages/*.po
Languages: ja_jp, ko_kr, vi_vn, zh_cn

# J0Y6yy
source: Cannot find a suitable category?
ja_jp: 適切なカテゴリが見つかりませんか？
ko_kr: 적합한 카테고리를 찾을 수 없나요?
vi_vn: Không tìm thấy danh mục phù hợp?
zh_cn: 找不到合适的分类？

# PmRC5G
source: Create Custom Category
ja_jp: カスタムカテゴリを作成
ko_kr: 사용자 정의 카테고리 만들기
vi_vn: Tạo danh mục tùy chỉnh
zh_cn: 创建自定义分类

# F3XA9+
source: Delete Goal
ja_jp: 目標を削除
ko_kr: 목표 삭제
vi_vn: Xóa mục tiêu
zh_cn: 删除目标

# EwRebq
source: Are you sure you want to delete this goal? This action cannot be undone.
ja_jp: この目標を削除してもよろしいですか？この操作は元に戻せません。
ko_kr: 이 목표를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
vi_vn: Bạn có chắc chắn muốn xóa mục tiêu này không? Hành động này không thể hoàn tác.
zh_cn: 您确定要删除此目标吗？此操作无法撤销。

# sOXElg
source: Edit Goal
ja_jp: 目標を編集
ko_kr: 목표 편집
vi_vn: Chỉnh sửa mục tiêu
zh_cn: 编辑目标

# 5WuADX
source: Add Goal
ja_jp: 目標を追加
ko_kr: 목표 추가
vi_vn: Thêm mục tiêu
zh_cn: 添加目标

# /kQug4
source: Update goal information.
ja_jp: 目標情報を更新します。
ko_kr: 목표 정보를 업데이트하세요.
vi_vn: Cập nhật thông tin mục tiêu.
zh_cn: 更新目标信息。

# dzmlX3
source: Create a new financial goal.
ja_jp: 新しい財務目標を作成します。
ko_kr: 새로운 재정 목표를 만드세요.
vi_vn: Tạo mục tiêu tài chính mới.
zh_cn: 创建一个新的财务目标。

# gQxxlw
source: Goal Name
ja_jp: 目標名
ko_kr: 목표 이름
vi_vn: Tên mục tiêu
zh_cn: 目标名称

# rH4tSt
source: e.g. Save for vacation
ja_jp: 例：休暇のための貯蓄
ko_kr: 예: 휴가 저축
vi_vn: ví dụ: Tiết kiệm cho kỳ nghỉ
zh_cn: 例如：为假期存钱

# MPOzul
source: Target Amount
ja_jp: 目標金額
ko_kr: 목표 금액
vi_vn: Số tiền mục tiêu
zh_cn: 目标金额

# +xHZ7x
source: Search goals...
ja_jp: 目標を検索...
ko_kr: 목표 검색...
vi_vn: Tìm kiếm mục tiêu...
zh_cn: 搜索目标...

# 8MCUlP
source: Good (≥ 100%)
ja_jp: 良好（≥ 100%）
ko_kr: 양호 (≥ 100%)
vi_vn: Tốt (≥ 100%)
zh_cn: 良好 (≥ 100%)

# O7nOCr
source: Low (75-100%)
ja_jp: 低い（75-100%）
ko_kr: 낮음 (75-100%)
vi_vn: Thấp (75-100%)
zh_cn: 低 (75-100%)

# 7IAF5Y
source: Warning (< 75%)
ja_jp: 警告（< 75%）
ko_kr: 경고 (< 75%)
vi_vn: Cảnh báo (< 75%)
zh_cn: 警告 (< 75%)

# 6rbe1E
source: Set and track your financial goals.
ja_jp: 財務目標を設定して追跡します。
ko_kr: 재정 목표를 설정하고 추적하세요.
vi_vn: Thiết lập và theo dõi các mục tiêu tài chính của bạn.
zh_cn: 设置并跟踪您的财务目标。

# uuJSCu
source: No goals found
ja_jp: 目標が見つかりません
ko_kr: 목표를 찾을 수 없습니다
vi_vn: Không tìm thấy mục tiêu
zh_cn: 未找到目标

# iB1AMy
source: Start setting your financial goals.
ko_kr: 재정 목표 설정을 시작하세요.
zh_cn: 开始设置您的财务目标。

# RB30ZK
source: No goals found matching your filters.
ja_jp: フィルターに一致する目標が見つかりませんでした。
ko_kr: 필터와 일치하는 목표를 찾을 수 없습니다.
vi_vn: Không tìm thấy mục tiêu phù hợp với bộ lọc của bạn.
zh_cn: 未找到符合筛选条件的目标。

# GkiQMs
source: Accumulated
ja_jp: 累計
ko_kr: 누적
vi_vn: Tích lũy
zh_cn: 已累积

# UKxoV8
source: Welcome back
ja_jp: おかえりなさい
ko_kr: 다시 오신 것을 환영합니다
vi_vn: Chào mừng trở lại
zh_cn: 欢迎回来

# 9A7jRV
source: Here's what's happening with your finances this month.
ja_jp: 今月の財務状況をご紹介します。
ko_kr: 이번 달 재정 상황을 확인하세요.
vi_vn: Đây là tình hình tài chính của bạn trong tháng này.
zh_cn: 这是本月您的财务状况。

# g28wjp
source: Quick Stats
ja_jp: クイック統計
ko_kr: 빠른 통계
vi_vn: Thống kê nhanh
zh_cn: 快速统计

# a3+VDd
source: Total Transactions
ja_jp: 取引総数
ko_kr: 총 거래 수
vi_vn: Tổng số giao dịch
zh_cn: 交易总数

# gaBuAW
source: Total number of transactions (both income and expenses) you have made.
ja_jp: 行った取引の総数（収入と支出の両方）。
ko_kr: 총 거래 수(수입 및 지출 모두).
vi_vn: Tổng số giao dịch (cả thu nhập và chi tiêu) bạn đã thực hiện.
zh_cn: 您进行的交易总数（收入和支出）。

# Prh2Lb
source: Highest Transaction
ja_jp: 最高取引
ko_kr: 최고 거래
vi_vn: Giao dịch cao nhất
zh_cn: 最高交易

# UG5qoS
source: No data
ja_jp: データなし
ko_kr: 데이터 없음
vi_vn: Không có dữ liệu
zh_cn: 无数据

# 5+Kbgx
source: Transaction with the highest value in the month (can be income or expense).
ja_jp: 月間で最も高い取引（収入または支出）。
ko_kr: 이번 달 가장 높은 금액의 거래(수입 또는 지출).
vi_vn: Giao dịch có giá trị cao nhất trong tháng (có thể là thu nhập hoặc chi tiêu).
zh_cn: 本月金额最高的交易（可能是收入或支出）。

# 9AS2Qs
source: Lowest Transaction
ja_jp: 最低取引
ko_kr: 최저 거래
vi_vn: Giao dịch thấp nhất
zh_cn: 最低交易

# gkpkvE
source: Transaction with the lowest value in the month (can be income or expense).
ja_jp: 月間で最も低い取引（収入または支出）。
ko_kr: 이번 달 가장 낮은 금액의 거래(수입 또는 지출).
vi_vn: Giao dịch có giá trị thấp nhất trong tháng (có thể là thu nhập hoặc chi tiêu).
zh_cn: 本月金额最低的交易（可能是收入或支出）。

# 5pB6eY
source: Average Expense
ja_jp: 平均支出
ko_kr: 평균 지출
vi_vn: Chi tiêu trung bình
zh_cn: 平均支出

# VP5MQP
source: Average amount per expense (Total Expense / Number of expense transactions).
ja_jp: 支出あたりの平均額（総支出 / 支出取引数）。
ko_kr: 지출당 평균 금액 (총 지출 / 지출 거래 수).
vi_vn: Số tiền trung bình cho mỗi lần chi tiêu (Tổng chi tiêu / Số lượng giao dịch chi tiêu).
zh_cn: 每笔支出的平均金额（总支出 / 支出交易次数）。

# AUkgKt
source: Savings Rate
ja_jp: 貯蓄率
ko_kr: 저축률
vi_vn: Tỷ lệ tiết kiệm
zh_cn: 储蓄率

# Q0mewJ
source: The percentage of money you save compared to income ((Income - Expense) / Income × 100%).
ja_jp: 収入に対する貯蓄の割合（（収入 - 支出）/ 収入 × 100%）。
ko_kr: 수입 대비 저축 비율 ((수입 - 지출) / 수입 × 100%).
vi_vn: Tỷ lệ phần trăm tiền bạn tiết kiệm so với thu nhập ((Thu nhập - Chi tiêu) / Thu nhập × 100%).
zh_cn: 您储蓄的金额占收入的百分比 ((收入 - 支出) / 收入 × 100%)。

# O8QihK
source: Popular Category
ja_jp: 人気カテゴリ
ko_kr: 인기 카테고리
vi_vn: Danh mục phổ biến
zh_cn: 热门分类

# wEyaDt
source: Category with the highest total amount in the month.
ja_jp: 月間で総額が最も高いカテゴリ。
ko_kr: 이번 달 총 금액이 가장 높은 카테고리.
vi_vn: Danh mục có tổng số tiền cao nhất trong tháng.
zh_cn: 本月总金额最高的分类。

# GMkXVd
source: Recent Transactions
ja_jp: 最近の取引
ko_kr: 최근 거래
vi_vn: Giao dịch gần đây
zh_cn: 近期交易

# LER0RZ
source: No transactions found
ja_jp: 取引が見つかりません
ko_kr: 거래를 찾을 수 없습니다
vi_vn: Không tìm thấy giao dịch
zh_cn: 未找到交易

# JWV3aB
source: Start adding your transactions.
ko_kr: 거래 추가를 시작하세요.
zh_cn: 开始添加您的交易。

# XUYy4C
source: Monthly Income
ja_jp: 月間収入
ko_kr: 월간 수입
vi_vn: Thu nhập hàng tháng
zh_cn: 月度收入

# 5+nDxs
source: transactions
ja_jp: 取引
ko_kr: 거래
vi_vn: giao dịch
zh_cn: 交易

# FR0il4
source: Monthly Expense
ja_jp: 月間支出
ko_kr: 월간 지출
vi_vn: Chi tiêu hàng tháng
zh_cn: 月度支出

# ZLrViM
source: Monthly Balance
ja_jp: 月間残高
ko_kr: 월간 잔액
vi_vn: Số dư hàng tháng
zh_cn: 月度余额

# dHVUaP
source: Positive
ja_jp: プラス
ko_kr: 양수
vi_vn: Dương
zh_cn: 正

# kVQ1fo
source: Negative
ja_jp: マイナス
ko_kr: 음수
vi_vn: Âm
zh_cn: 负

# r0q/a1
source: Balanced
ja_jp: バランス
ko_kr: 균형
vi_vn: Cân bằng
zh_cn: 平衡

# qTQZsz
source: compared to income
ja_jp: 収入と比較
ko_kr: 수입 대비
vi_vn: so với thu nhập
zh_cn: 与收入相比

# oj0aXj
source: Signing out...
ja_jp: サインアウト中...
ko_kr: 로그아웃 중...
vi_vn: Đang đăng xuất...
zh_cn: 正在退出...

# hlp8qc
source: Signed out.
ja_jp: サインアウトしました。
ko_kr: 로그아웃되었습니다.
vi_vn: Đã đăng xuất.
zh_cn: 已退出。

# XuxYAf
source: Failed to sign out! Please try again later.
ja_jp: サインアウトに失敗しました！後でもう一度お試しください。
ko_kr: 로그아웃에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Đăng xuất thất bại! Vui lòng thử lại sau.
zh_cn: 退出失败！请稍后再试。

# F62y+K
source: Sign Out
ja_jp: サインアウト
ko_kr: 로그아웃
vi_vn: Đăng xuất
zh_cn: 退出

# BHBJUz
source: Are you sure you want to sign out?
ja_jp: サインアウトしてもよろしいですか？
ko_kr: 로그아웃하시겠습니까?
vi_vn: Bạn có chắc chắn muốn đăng xuất không?
zh_cn: 您确定要退出吗？

# naYgGy
source: You will need to sign in again to access your account.
ja_jp: アカウントにアクセスするには、再度サインインする必要があります。
ko_kr: 계정에 다시 액세스하려면 다시 로그인해야 합니다.
vi_vn: Bạn sẽ cần đăng nhập lại để truy cập tài khoản của mình.
zh_cn: 您需要重新登录才能访问您的帐户。

# mwZmom
source: Delete Recurring Transaction
ja_jp: 定期取引を削除
ko_kr: 반복 거래 삭제
vi_vn: Xóa giao dịch định kỳ
zh_cn: 删除定期交易

# B58bFw
source: Are you sure you want to delete this recurring transaction? This action cannot be undone.
ja_jp: この定期取引を削除してもよろしいですか？この操作は元に戻せません。
ko_kr: 이 반복 거래를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
vi_vn: Bạn có chắc chắn muốn xóa giao dịch định kỳ này không? Hành động này không thể hoàn tác.
zh_cn: 您确定要删除此定期交易吗？此操作无法撤销。

# 5nuO2v
source: Edit Recurring Transaction
ja_jp: 定期取引を編集
ko_kr: 반복 거래 편집
vi_vn: Chỉnh sửa giao dịch định kỳ
zh_cn: 编辑定期交易

# sYXY5N
source: Add Recurring Transaction
ja_jp: 定期取引を追加
ko_kr: 반복 거래 추가
vi_vn: Thêm giao dịch định kỳ
zh_cn: 添加定期交易

# gKA6Xf
source: Update recurring transaction information.
ja_jp: 定期取引情報を更新します。
ko_kr: 반복 거래 정보를 업데이트하세요.
vi_vn: Cập nhật thông tin giao dịch định kỳ.
zh_cn: 更新定期交易信息。

# adePxB
source: Create a recurring transaction.
ja_jp: 定期取引を作成します。
ko_kr: 반복 거래를 만드세요.
vi_vn: Tạo một giao dịch định kỳ.
zh_cn: 创建定期交易。

# vAW30j
source: Frequency
ja_jp: 頻度
ko_kr: 빈도
vi_vn: Tần suất
zh_cn: 频率

# zxvhnE
source: Daily
ja_jp: 日次
ko_kr: 일간
vi_vn: Hàng ngày
zh_cn: 每天

# /clOBU
source: Weekly
ja_jp: 週次
ko_kr: 주간
vi_vn: Hàng tuần
zh_cn: 每周

# 03X4YH
source: Bi-Weekly
ja_jp: 隔週
ko_kr: 격주
vi_vn: Hai tuần một lần
zh_cn: 每两周

# wYsv4Z
source: Monthly
ja_jp: 月次
ko_kr: 월간
vi_vn: Hàng tháng
zh_cn: 每月

# b1Ou36
source: Quarterly
ja_jp: 四半期
ko_kr: 분기별
vi_vn: Hàng quý
zh_cn: 每季度

# dqD39h
source: Yearly
ja_jp: 年次
ko_kr: 연간
vi_vn: Hàng năm
zh_cn: 每年

# D9n+q2
source: Random
ja_jp: ランダム
ko_kr: 무작위
vi_vn: Ngẫu nhiên
zh_cn: 随机

# CpM7W/
source: Every X Days
ja_jp: X日ごと
ko_kr: X일마다
vi_vn: Mỗi X ngày
zh_cn: 每 X 天

# FP2XQQ
source: e.g. 15
ja_jp: 例：15
ko_kr: 예: 15
vi_vn: ví dụ: 15
zh_cn: 例如：15

# InWqys
source: Optional
ja_jp: オプション
ko_kr: 선택사항
vi_vn: Không bắt buộc
zh_cn: 可选

# mpcI7I
source: No End Date
ja_jp: 終了日なし
ko_kr: 종료일 없음
vi_vn: Không có ngày kết thúc
zh_cn: 无结束日期

# 6Tps09
source: Inactive
ja_jp: 非アクティブ
ko_kr: 비활성
vi_vn: Không hoạt động
zh_cn: 不活跃

# jZimtU
source: Search recurring transactions...
ja_jp: 定期取引を検索...
ko_kr: 반복 거래 검색...
vi_vn: Tìm kiếm giao dịch định kỳ...
zh_cn: 搜索定期交易...

# v84fNv
source: Recurring
ja_jp: 定期
ko_kr: 반복
vi_vn: Định kỳ
zh_cn: 定期

# w8tTYc
source: Manage your recurring transactions.
ja_jp: 定期取引を管理します。
ko_kr: 반복 거래를 관리하세요.
vi_vn: Quản lý các giao dịch định kỳ của bạn.
zh_cn: 管理您的定期交易。

# xRs5e/
source: No recurring transactions found
ja_jp: 定期取引が見つかりません
ko_kr: 반복 거래를 찾을 수 없습니다
vi_vn: Không tìm thấy giao dịch định kỳ
zh_cn: 未找到定期交易

# bhzq2y
source: Start adding your recurring transactions.
ko_kr: 반복 거래 추가를 시작하세요.
zh_cn: 开始添加您的定期交易。

# hZPPxy
source: No recurring transactions found matching your filters.
ja_jp: フィルターに一致する定期取引が見つかりませんでした。
ko_kr: 필터와 일치하는 반복 거래를 찾을 수 없습니다.
vi_vn: Không tìm thấy giao dịch định kỳ phù hợp với bộ lọc của bạn.
zh_cn: 未找到符合筛选条件的定期交易。

# CrEhnK
source: No end date
ja_jp: 終了日なし
ko_kr: 종료일 없음
vi_vn: Không có ngày kết thúc
zh_cn: 无结束日期

# qYXK93
source: Every {days} days
ja_jp: {days}日ごと
ko_kr: {days}일마다
vi_vn: Mỗi {days} ngày
zh_cn: 每 {days} 天

# b+8NFf
source: Next: {date}
ja_jp: 次回：{date}
ko_kr: 다음: {date}
vi_vn: Tiếp theo: {date}
zh_cn: 下次：{date}

# M3ZAZv
source: Failed to terminate session! Please try again later.
ja_jp: セッションの終了に失敗しました！後でもう一度お試しください。
ko_kr: 세션 종료에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Chấm dứt phiên thất bại! Vui lòng thử lại sau.
zh_cn: 终止会话失败！请稍后再试。

# tNzaek
source: Session terminated.
ja_jp: セッションが終了しました。
ko_kr: 세션이 종료되었습니다.
vi_vn: Phiên đã bị chấm dứt.
zh_cn: 会话已终止。

# HuQudj
source: Failed to terminate all sessions! Please try again later.
ja_jp: すべてのセッションの終了に失敗しました！後でもう一度お試しください。
ko_kr: 모든 세션 종료에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Chấm dứt tất cả các phiên thất bại! Vui lòng thử lại sau.
zh_cn: 终止所有会话失败！请稍后再试。

# i3aVwj
source: All sessions terminated.
ja_jp: すべてのセッションが終了しました。
ko_kr: 모든 세션이 종료되었습니다.
vi_vn: Tất cả các phiên đã bị chấm dứt.
zh_cn: 所有会话已终止。

# h/tqwp
source: View Active Sessions
ja_jp: アクティブセッションを表示
ko_kr: 활성 세션 보기
vi_vn: Xem các phiên đang hoạt động
zh_cn: 查看活跃会话

# V3ka34
source: Active Sessions
ja_jp: アクティブセッション
ko_kr: 활성 세션
vi_vn: Các phiên đang hoạt động
zh_cn: 活跃会话

# xLvLBD
source: Manage your active sessions.
ja_jp: アクティブセッションを管理します。
ko_kr: 활성 세션을 관리하세요.
vi_vn: Quản lý các phiên đang hoạt động của bạn.
zh_cn: 管理您的活跃会话。

# fF376U
source: Current
ja_jp: 現在
ko_kr: 현재
vi_vn: Hiện tại
zh_cn: 当前

# bLQmWN
source: Unknown Location
ja_jp: 不明な場所
ko_kr: 알 수 없는 위치
vi_vn: Vị trí không xác định
zh_cn: 未知位置

# oA2uW/
source: Terminate
ja_jp: 終了
ko_kr: 종료
vi_vn: Chấm dứt
zh_cn: 终止

# DC/DQF
source: Terminate All
ja_jp: すべて終了
ko_kr: 모두 종료
vi_vn: Chấm dứt tất cả
zh_cn: 终止所有

# pdaEmb
source: Failed to update name! Please try again later.
ja_jp: 名前の更新に失敗しました！後でもう一度お試しください。
ko_kr: 이름 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật tên thất bại! Vui lòng thử lại sau.
zh_cn: 更新姓名失败！请稍后再试。

# oALrPz
source: Your name has been updated.
ja_jp: 名前が更新されました。
ko_kr: 이름이 업데이트되었습니다.
vi_vn: Tên của bạn đã được cập nhật.
zh_cn: 您的姓名已更新。

# r5LPv0
source: Change Name
ja_jp: 名前を変更
ko_kr: 이름 변경
vi_vn: Đổi tên
zh_cn: 更改姓名

# z7OVdl
source: Update your display name.
ja_jp: 表示名を更新します。
ko_kr: 표시 이름을 업데이트하세요.
vi_vn: Cập nhật tên hiển thị của bạn.
zh_cn: 更新您的显示名称。

# HAlOn1
source: Name
ja_jp: 名前
ko_kr: 이름
vi_vn: Tên
zh_cn: 姓名

# g4FbZ5
source: Enter your name...
ja_jp: 名前を入力...
ko_kr: 이름을 입력하세요...
vi_vn: Nhập tên của bạn...
zh_cn: 输入您的姓名...

# jvo0vs
source: Save
ja_jp: 保存
ko_kr: 저장
vi_vn: Lưu
zh_cn: 保存

# UR3aU3
source: Current password is incorrect!
ja_jp: 現在のパスワードが正しくありません！
ko_kr: 현재 비밀번호가 올바르지 않습니다!
vi_vn: Mật khẩu hiện tại không chính xác!
zh_cn: 当前密码不正确！

# I+C2uX
source: Failed to update password! Please try again later.
ja_jp: パスワードの更新に失敗しました！後でもう一度お試しください。
ko_kr: 비밀번호 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật mật khẩu thất bại! Vui lòng thử lại sau.
zh_cn: 更新密码失败！请稍后再试。

# kgHPAz
source: Your password has been changed.
ja_jp: パスワードが変更されました。
ko_kr: 비밀번호가 변경되었습니다.
vi_vn: Mật khẩu của bạn đã được thay đổi.
zh_cn: 您的密码已更改。

# QiKKFz
source: Change Password
ja_jp: パスワードを変更
ko_kr: 비밀번호 변경
vi_vn: Đổi mật khẩu
zh_cn: 更改密码

# luD+rc
source: Update your password.
ja_jp: パスワードを更新します。
ko_kr: 비밀번호를 업데이트하세요.
vi_vn: Cập nhật mật khẩu của bạn.
zh_cn: 更新您的密码。

# GretYf
source: Current Password
ja_jp: 現在のパスワード
ko_kr: 현재 비밀번호
vi_vn: Mật khẩu hiện tại
zh_cn: 当前密码

# Ev6SEF
source: New Password
ja_jp: 新しいパスワード
ko_kr: 새 비밀번호
vi_vn: Mật khẩu mới
zh_cn: 新密码

# vfG+nh
source: Confirm Password
ja_jp: パスワードを確認
ko_kr: 비밀번호 확인
vi_vn: Xác nhận mật khẩu
zh_cn: 确认密码

# zFD28X
source: Sign out from all other devices.
ja_jp: 他のすべてのデバイスからサインアウトします。
ko_kr: 다른 모든 기기에서 로그아웃하세요.
vi_vn: Đăng xuất khỏi tất cả các thiết bị khác.
zh_cn: 从所有其他设备退出。

# K3OKU5
source: Failed to check username availability! Please try again later.
ja_jp: ユーザー名の利用可能性の確認に失敗しました！後でもう一度お試しください。
ko_kr: 사용자 이름 사용 가능 여부 확인에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Kiểm tra tính khả dụng của tên đăng nhập thất bại! Vui lòng thử lại sau.
zh_cn: 检查用户名可用性失败！请稍后再试。

# wb3MSp
source: This username is already taken.
ja_jp: このユーザー名は既に使用されています。
ko_kr: 이 사용자 이름은 이미 사용 중입니다.
vi_vn: Tên đăng nhập này đã được sử dụng.
zh_cn: 此用户名已被占用。

# IaZaQX
source: Failed to update username! Please try again later.
ja_jp: ユーザー名の更新に失敗しました！後でもう一度お試しください。
ko_kr: 사용자 이름 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật tên đăng nhập thất bại! Vui lòng thử lại sau.
zh_cn: 更新用户名失败！请稍后再试。

# 8KK2w+
source: Your username has been changed.
ja_jp: ユーザー名が変更されました。
ko_kr: 사용자 이름이 변경되었습니다.
vi_vn: Tên đăng nhập của bạn đã được thay đổi.
zh_cn: 您的用户名已更改。

# 19mdX0
source: Change Username
ja_jp: ユーザー名を変更
ko_kr: 사용자 이름 변경
vi_vn: Đổi tên đăng nhập
zh_cn: 更改用户名

# TXe4LX
source: Update your unique username.
ja_jp: 一意のユーザー名を更新します。
ko_kr: 고유한 사용자 이름을 업데이트하세요.
vi_vn: Cập nhật tên đăng nhập duy nhất của bạn.
zh_cn: 更新您的唯一用户名。

# v60thv
source: Enter your username...
ja_jp: ユーザー名を入力...
ko_kr: 사용자 이름을 입력하세요...
vi_vn: Nhập tên đăng nhập của bạn...
zh_cn: 输入您的用户名...

# d6wGcQ
source: Failed to update currency! Please try again later.
ja_jp: 通貨の更新に失敗しました！後でもう一度お試しください。
ko_kr: 통화 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật tiền tệ thất bại! Vui lòng thử lại sau.
zh_cn: 更新货币失败！请稍后再试。

# Ax3Nmj
source: Failed to update language! Please try again later.
ja_jp: 言語の更新に失敗しました！後でもう一度お試しください。
ko_kr: 언어 업데이트에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Cập nhật ngôn ngữ thất bại! Vui lòng thử lại sau.
zh_cn: 更新语言失败！请稍后再试。

# y1Z3or
source: Language
ja_jp: 言語
ko_kr: 언어
vi_vn: Ngôn ngữ
zh_cn: 语言

# 1iEPTM
source: General
ja_jp: 一般
ko_kr: 일반
vi_vn: Chung
zh_cn: 常规

# TwyMau
source: Account
ja_jp: アカウント
ko_kr: 계정
vi_vn: Tài khoản
zh_cn: 帐户

# 2GURQY
source: Appearance
ja_jp: 外観
ko_kr: 외관
vi_vn: Giao diện
zh_cn: 外观

# NAnTXq
source: Choose the display theme for the application.
ja_jp: アプリケーションの表示テーマを選択してください。
ko_kr: 애플리케이션의 표시 테마를 선택하세요.
vi_vn: Chọn chủ đề hiển thị cho ứng dụng.
zh_cn: 选择应用程序的显示主题。

# 9ar+T+
source: Select your preferred language.
ja_jp: 希望する言語を選択してください。
ko_kr: 선호하는 언어를 선택하세요.
vi_vn: Chọn ngôn ngữ ưa thích của bạn.
zh_cn: 选择您的首选语言。

# mgyPZS
source: Select your preferred currency for displaying amounts.
ja_jp: 金額表示に使用する通貨を選択してください。
ko_kr: 금액 표시를 위한 선호하는 통화를 선택하세요.
vi_vn: Chọn loại tiền tệ ưa thích của bạn để hiển thị số tiền.
zh_cn: 选择您的首选货币以显示金额。

# Gr0AtT
source: Add an extra layer of security to your account.
ja_jp: アカウントにセキュリティの追加レイヤーを追加します。
ko_kr: 계정에 보안 계층을 추가하세요.
vi_vn: Thêm một lớp bảo mật bổ sung cho tài khoản của bạn.
zh_cn: 为您的帐户添加额外的安全层。

# 3cc4Ct
source: Light
ja_jp: ライト
ko_kr: 라이트
vi_vn: Sáng
zh_cn: 浅色

# tOdNiY
source: Dark
ja_jp: ダーク
ko_kr: 다크
vi_vn: Tối
zh_cn: 深色

# +CwN9C
source: System
ja_jp: システム
ko_kr: 시스템
vi_vn: Hệ thống
zh_cn: 系统

# EQpyb8
source: Toggle theme
ja_jp: テーマを切り替え
ko_kr: 테마 전환
vi_vn: Chuyển đổi chủ đề
zh_cn: 切换主题

# e7Db3T
source: Disable 2FA
ja_jp: 2FAを無効化
ko_kr: 2FA 비활성화
vi_vn: Tắt 2FA
zh_cn: 禁用 2FA

# ZhrNZz
source: Enable 2FA
ja_jp: 2FAを有効化
ko_kr: 2FA 활성화
vi_vn: Bật 2FA
zh_cn: 启用 2FA

# deAXlH
source: Enable Two-Factor Authentication
ja_jp: 二要素認証を有効化
ko_kr: 2단계 인증 활성화
vi_vn: Bật xác thực hai yếu tố
zh_cn: 启用双重身份验证

# VNORmj
source: Scan the QR code with your authenticator app.
ja_jp: 認証アプリでQRコードをスキャンしてください。
ko_kr: 인증 앱으로 QR 코드를 스캔하세요.
vi_vn: Quét mã QR bằng ứng dụng xác thực của bạn.
zh_cn: 使用您的身份验证器应用扫描二维码。

# JHBmG8
source: Secret Key
ja_jp: シークレットキー
ko_kr: 비밀 키
vi_vn: Khóa bí mật
zh_cn: 密钥

# 0onqf3
source: Disable Two-Factor Authentication
ja_jp: 二要素認証を無効化
ko_kr: 2단계 인증 비활성화
vi_vn: Tắt xác thực hai yếu tố
zh_cn: 禁用双重身份验证

# fUrrOz
source: Enter your password to disable 2FA.
ja_jp: 2FAを無効化するには、パスワードを入力してください。
ko_kr: 2FA를 비활성화하려면 비밀번호를 입력하세요.
vi_vn: Nhập mật khẩu của bạn để tắt 2FA.
zh_cn: 输入您的密码以禁用 2FA。

# 6vQ8Z2
source: Invalid password.
ja_jp: パスワードが無効です。
ko_kr: 잘못된 비밀번호입니다.
vi_vn: Mật khẩu không hợp lệ.
zh_cn: 密码无效。

# Lq08V/
source: Failed to enable 2FA! Please try again later.
ja_jp: 2FAの有効化に失敗しました！後でもう一度お試しください。
ko_kr: 2FA 활성화에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Bật 2FA thất bại! Vui lòng thử lại sau.
zh_cn: 启用 2FA 失败！请稍后再试。

# 02Huvd
source: Failed to verify 2FA code! Please try again later.
ja_jp: 2FAコードの確認に失敗しました！後でもう一度お試しください。
ko_kr: 2FA 코드 확인에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xác minh mã 2FA thất bại! Vui lòng thử lại sau.
zh_cn: 验证 2FA 代码失败！请稍后再试。

# FSRmm9
source: Two-factor authentication is now enabled.
ja_jp: 二要素認証が有効になりました。
ko_kr: 2단계 인증이 활성화되었습니다.
vi_vn: Xác thực hai yếu tố đã được bật.
zh_cn: 双重身份验证现已启用。

# Y1o/zZ
source: Failed to disable 2FA! Please try again later.
ja_jp: 2FAの無効化に失敗しました！後でもう一度お試しください。
ko_kr: 2FA 비활성화에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Tắt 2FA thất bại! Vui lòng thử lại sau.
zh_cn: 禁用 2FA 失败！请稍后再试。

# BBb4xb
source: Two-factor authentication is now disabled.
ja_jp: 二要素認証が無効になりました。
ko_kr: 2단계 인증이 비활성화되었습니다.
vi_vn: Xác thực hai yếu tố đã được tắt.
zh_cn: 双重身份验证现已禁用。

# KAX9q+
source: Select Date Range
ja_jp: 日付範囲を選択
ko_kr: 날짜 범위 선택
vi_vn: Chọn khoảng thời gian
zh_cn: 选择日期范围

# dM+p3/
source: From
ja_jp: から
ko_kr: 부터
vi_vn: Từ
zh_cn: 自

# 9j3hXO
source: To
ja_jp: まで
ko_kr: 까지
vi_vn: Đến
zh_cn: 至

# wqp6W5
source: View your financial statistics.
ja_jp: 財務統計を表示します。
ko_kr: 재정 통계를 확인하세요.
vi_vn: Xem thống kê tài chính của bạn.
zh_cn: 查看您的财务统计数据。

# q2bcKc
source: Total Income
ja_jp: 総収入
ko_kr: 총 수입
vi_vn: Tổng thu nhập
zh_cn: 总收入

# F3K//T
source: Total Expense
ja_jp: 総支出
ko_kr: 총 지출
vi_vn: Tổng chi tiêu
zh_cn: 总支出

# cX8/D7
source: Total number of transactions
ja_jp: 取引総数
ko_kr: 총 거래 수
vi_vn: Tổng số giao dịch
zh_cn: 交易总数

# Cl5VLx
source: No transactions found matching your filters.
ja_jp: フィルターに一致する取引が見つかりませんでした。
ko_kr: 필터와 일치하는 거래를 찾을 수 없습니다.
vi_vn: Không tìm thấy giao dịch phù hợp với bộ lọc của bạn.
zh_cn: 未找到符合筛选条件的交易。

# gsAs8V
source: Transaction Count
ja_jp: 取引数
ko_kr: 거래 수
vi_vn: Số lượng giao dịch
zh_cn: 交易计数

# CDTMW3
source: Total Amount
ja_jp: 総額
ko_kr: 총 금액
vi_vn: Tổng số tiền
zh_cn: 总金额

# nPfy7y
source: Delete Transaction
ja_jp: 取引を削除
ko_kr: 거래 삭제
vi_vn: Xóa giao dịch
zh_cn: 删除交易

# cj6kmp
source: Are you sure you want to delete this transaction? This action cannot be undone.
ja_jp: この取引を削除してもよろしいですか？この操作は元に戻せません。
ko_kr: 이 거래를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
vi_vn: Bạn có chắc chắn muốn xóa giao dịch này không? Hành động này không thể hoàn tác.
zh_cn: 您确定要删除此交易吗？此操作无法撤销。

# P7PLVj
source: Date
ja_jp: 日付
ko_kr: 날짜
vi_vn: Ngày
zh_cn: 日期

# jRf7yh
source: Export Transactions (CSV)
ja_jp: 取引をエクスポート（CSV）
ko_kr: 거래 내보내기 (CSV)
vi_vn: Xuất giao dịch (CSV)
zh_cn: 导出交易 (CSV)

# 6L1Gl2
source: Failed to export data! Please try again later.
ja_jp: データのエクスポートに失敗しました！後でもう一度お試しください。
ko_kr: 데이터 내보내기에 실패했습니다! 나중에 다시 시도해주세요.
vi_vn: Xuất dữ liệu thất bại! Vui lòng thử lại sau.
zh_cn: 导出数据失败！请稍后再试。

# hTOF+7
source: Export Transactions
ja_jp: 取引をエクスポート
ko_kr: 거래 내보내기
vi_vn: Xuất giao dịch
zh_cn: 导出交易

# 0S1jq/
source: Export transactions with current filters applied
ja_jp: 現在のフィルターを適用して取引をエクスポート
ko_kr: 현재 필터가 적용된 거래 내보내기
vi_vn: Xuất các giao dịch với các bộ lọc hiện tại được áp dụng
zh_cn: 导出应用当前筛选条件的交易

# P5C72A
source: Edit Transaction
ja_jp: 取引を編集
ko_kr: 거래 편집
vi_vn: Chỉnh sửa giao dịch
zh_cn: 编辑交易

# DJIUi0
source: Add Transaction
ja_jp: 取引を追加
ko_kr: 거래 추가
vi_vn: Thêm giao dịch
zh_cn: 添加交易

# ET95oG
source: Update transaction information.
ja_jp: 取引情報を更新します。
ko_kr: 거래 정보를 업데이트하세요.
vi_vn: Cập nhật thông tin giao dịch.
zh_cn: 更新交易信息。

# m3AQtz
source: Add your income or expense to track your personal finances.
ja_jp: 個人の財務を追跡するために、収入または支出を追加します。
ko_kr: 개인 재정을 추적하기 위해 수입 또는 지출을 추가하세요.
vi_vn: Thêm thu nhập hoặc chi tiêu của bạn để theo dõi tài chính cá nhân.
zh_cn: 添加您的收入或支出以跟踪您的个人财务状况。

# 9WG2aE
source: Enter a description for the transaction...
ja_jp: 取引の説明を入力...
ko_kr: 거래에 대한 설명을 입력하세요...
vi_vn: Nhập mô tả cho giao dịch...
zh_cn: 输入交易描述...

# gD5509
source: Search transactions...
ja_jp: 取引を検索...
ko_kr: 거래 검색...
vi_vn: Tìm kiếm giao dịch...
zh_cn: 搜索交易...

# PRC7nC
source: Manage income and expenses to track your personal finances.
ja_jp: 個人の財務を追跡するために、収入と支出を管理します。
ko_kr: 개인 재정을 추적하기 위해 수입과 지출을 관리하세요.
vi_vn: Quản lý thu nhập và chi tiêu để theo dõi tài chính cá nhân.
zh_cn: 管理收入和支出以跟踪您的个人财务状况。

# 7MY/4L
source: Salary & Bonus
ja_jp: 給与・ボーナス
ko_kr: 급여 및 보너스
vi_vn: Lương & Thưởng
zh_cn: 工资与奖金

# BNse/p
source: Base salary, performance bonus, holiday bonus, allowances, etc.
ja_jp: 基本給、業績ボーナス、休暇ボーナス、手当など。
ko_kr: 기본 급여, 성과 보너스, 휴가 보너스, 수당 등
vi_vn: Lương cơ bản, thưởng hiệu suất, thưởng lễ tết, phụ cấp, v.v.
zh_cn: 基本工资、绩效奖金、节日奖金、津贴等。

# B2jc7q
source: Business & Freelance
ja_jp: ビジネス・フリーランス
ko_kr: 사업 및 프리랜서
vi_vn: Kinh doanh & Tự do
zh_cn: 商业与自由职业

# oKluKH
source: Sales revenue, services, freelance, short-term contracts, etc.
ja_jp: 売上、サービス、フリーランス、短期契約など。
ko_kr: 매출, 서비스, 프리랜서, 단기 계약 등
vi_vn: Doanh thu bán hàng, dịch vụ, làm việc tự do, hợp đồng ngắn hạn, v.v.
zh_cn: 销售收入、服务、自由职业、短期合同等。

# igDrI+
source: Investment & Passive Income
ja_jp: 投資・不労所得
ko_kr: 투자 및 수동 소득
vi_vn: Đầu tư & Thu nhập thụ động
zh_cn: 投资与被动收入

# dpjEgD
source: Savings interest, dividends, bonds interest, rental, royalties, etc.
ja_jp: 貯蓄利息、配当、債券利息、賃貸、ロイヤリティなど。
ko_kr: 저축 이자, 배당금, 채권 이자, 임대료, 로열티 등
vi_vn: Lãi tiết kiệm, cổ tức, lãi trái phiếu, tiền thuê nhà, tiền bản quyền, v.v.
zh_cn: 储蓄利息、股息、债券利息、租金、版税等。

# UsRS8G
source: Gifts & Support
ja_jp: 贈り物・支援
ko_kr: 선물 및 지원
vi_vn: Quà tặng & Hỗ trợ
zh_cn: 礼物与支持

# QRzRc0
source: Cash gifts, family support, celebration money, etc.
ja_jp: 現金の贈り物、家族支援、お祝い金など。
ko_kr: 현금 선물, 가족 지원, 축하금 등
vi_vn: Quà tặng tiền mặt, hỗ trợ gia đình, tiền mừng, v.v.
zh_cn: 现金礼物、家庭支持、礼金等。

# 3M2DQp
source: Other Income
ja_jp: その他の収入
ko_kr: 기타 수입
vi_vn: Thu nhập khác
zh_cn: 其他收入
