Repository: iwmywn/personal-and-family-finance-app
Catalog: messages/*.po
Languages: ja_jp, ko_kr, vi_vn, zh_cn

# +vWFfX
source: Refunds, selling used items, prizes, unexpected amounts, etc.
ja_jp: 返金、中古品販売、賞金、予期しない金額など。
ko_kr: 환불, 중고 판매, 상금, 예상치 못한 금액 등
vi_vn: Hoàn tiền, bán đồ cũ, giải thưởng, các khoản bất ngờ, v.v.
zh_cn: 退款、出售二手物品、奖金、意外款项等。

# jyebiC
source: Food & Beverage
ja_jp: 飲食
ko_kr: 식음료
vi_vn: Ăn uống
zh_cn: 餐饮

# 4Vdjbv
source: Groceries, markets, restaurants, cafes, breakfast/lunch/dinner, etc.
ja_jp: 食料品、市場、レストラン、カフェ、朝食/昼食/夕食など。
ko_kr: 식료품, 시장, 식당, 카페, 아침/점심/저녁 등
vi_vn: Tạp hóa, chợ, nhà hàng, quán cà phê, ăn sáng/trưa/tối, v.v.
zh_cn: 杂货、市场、餐馆、咖啡馆、早/午/晚餐等。

# /x7aOj
source: Transportation
ja_jp: 交通
ko_kr: 교통
vi_vn: Di chuyển
zh_cn: 交通

# X/LFZv
source: Fuel, bus/grab, vehicle maintenance, parking fees, etc.
ja_jp: 燃料、バス/グラブ、車両メンテナンス、駐車料金など。
ko_kr: 연료, 버스/그랩, 차량 유지보수, 주차비 등
vi_vn: Xăng xe, xe buýt/grab, bảo dưỡng xe, phí đỗ xe, v.v.
zh_cn: 燃料、公交/网约车、车辆维护、停车费等。

# VoH7HP
source: Personal Care
ja_jp: 身だしなみ
ko_kr: 개인 관리
vi_vn: Chăm sóc cá nhân
zh_cn: 个人护理

# KjBENf
source: Haircut, manicure, spa, massage, hair dye, skincare, etc.
ja_jp: 散髪、マニキュア、スパ、マッサージ、ヘアカラー、スキンケアなど。
ko_kr: 이발, 매니큐어, 스파, 마사지, 염색, 스킨케어 등
vi_vn: Cắt tóc, làm móng, spa, massage, nhuộm tóc, chăm sóc da, v.v.
zh_cn: 理发、美甲、水疗、按摩、染发、护肤等。

# my1MLn
source: Shopping
ja_jp: ショッピング
ko_kr: 쇼핑
vi_vn: Mua sắm
zh_cn: 购物

# HowRY4
source: Clothes, shoes, cosmetics, accessories, electronics, household items, etc.
ja_jp: 衣服、靴、化粧品、アクセサリー、電子機器、家庭用品など。
ko_kr: 의류, 신발, 화장품, 액세서리, 전자제품, 가정용품 등
vi_vn: Quần áo, giày dép, mỹ phẩm, phụ kiện, đồ điện tử, đồ gia dụng, v.v.
zh_cn: 衣服、鞋子、化妆品、配饰、电子产品、家居用品等。

# AURASB
source: Family Support
ja_jp: 家族支援
ko_kr: 가족 지원
vi_vn: Hỗ trợ gia đình
zh_cn: 家庭支持

# LCwChs
source: Money for parents, support for siblings, relatives, etc.
ja_jp: 両親へのお金、兄弟への支援、親戚など。
ko_kr: 부모님 돈, 형제자매 지원, 친척 등
vi_vn: Tiền biếu bố mẹ, hỗ trợ anh chị em, họ hàng, v.v.
zh_cn: 给父母的钱、支持兄弟姐妹、亲戚等。

# VCWKjW
source: Housing & Utilities
ja_jp: 住宅・公共料金
ko_kr: 주거 및 유틸리티
vi_vn: Nhà ở & Tiện ích
zh_cn: 住房与水电

# 0zQ/kK
source: Rent, electricity, water, gas, internet, phone, management fees, etc.
ja_jp: 家賃、電気、水道、ガス、インターネット、電話、管理費など。
ko_kr: 임대료, 전기, 수도, 가스, 인터넷, 전화, 관리비 등
vi_vn: Thuê nhà, điện, nước, gas, internet, điện thoại, phí quản lý, v.v.
zh_cn: 房租、水电费、燃气费、网络、电话、管理费等。

# AvfH/3
source: Healthcare & Insurance
ja_jp: 医療・保険
ko_kr: 의료 및 보험
vi_vn: Y tế & Bảo hiểm
zh_cn: 医疗与保险

# zJU6tX
source: Medical visits, medicine, health/life insurance, etc.
ja_jp: 診察、薬、健康/生命保険など。
ko_kr: 의료 방문, 약, 건강/생명 보험 등
vi_vn: Khám bệnh, thuốc men, bảo hiểm y tế/nhân thọ, v.v.
zh_cn: 就医、药品、健康/人寿保险等。

# n6fmhq
source: Education & Development
ja_jp: 教育・開発
ko_kr: 교육 및 개발
vi_vn: Giáo dục & Phát triển
zh_cn: 教育与发展

# U5tQLZ
source: Tuition, books, online/offline courses, certificates, seminars, etc.
ja_jp: 授業料、書籍、オンライン/オフラインコース、証明書、セミナーなど。
ko_kr: 수업료, 책, 온라인/오프라인 강의, 자격증, 세미나 등
vi_vn: Học phí, sách, khóa học online/offline, chứng chỉ, hội thảo, v.v.
zh_cn: 学费、书籍、线上/线下课程、证书、研讨会等。

# rLxG+6
source: Entertainment & Leisure
ja_jp: 娯楽・レジャー
ko_kr: 오락 및 여가
vi_vn: Giải trí & Thư giãn
zh_cn: 娱乐与休闲

# ASzmVA
source: Travel, movies, music, games, gym, hobbies, etc.
ja_jp: 旅行、映画、音楽、ゲーム、ジム、趣味など。
ko_kr: 여행, 영화, 음악, 게임, 체육관, 취미 등
vi_vn: Du lịch, phim ảnh, âm nhạc, trò chơi, gym, sở thích, v.v.
zh_cn: 旅行、电影、音乐、游戏、健身房、爱好等。

# Mhg8/5
source: Social & Gifts
ja_jp: 社交・贈り物
ko_kr: 사교 및 선물
vi_vn: Xã giao & Quà tặng
zh_cn: 社交与礼物

# mhXJmF
source: Weddings, funerals, birthdays, gifts for friends, gatherings, etc.
ja_jp: 結婚式、葬式、誕生日、友人への贈り物、集まりなど。
ko_kr: 결혼식, 장례식, 생일, 친구 선물, 모임 등
vi_vn: Đám cưới, đám tang, sinh nhật, quà tặng bạn bè, tụ tập, v.v.
zh_cn: 婚礼、葬礼、生日、朋友礼物、聚会等。

# +PDYFb
source: Savings & Investment
ja_jp: 貯蓄・投資
ko_kr: 저축 및 투자
vi_vn: Tiết kiệm & Đầu tư
zh_cn: 储蓄与投资

# lW1Dvw
source: Savings, stocks, funds, real estate, crypto, emergency fund, etc.
ja_jp: 貯蓄、株式、ファンド、不動産、暗号通貨、緊急資金など。
ko_kr: 저축, 주식, 펀드, 부동산, 암호화폐, 비상금 등
vi_vn: Tiết kiệm, cổ phiếu, quỹ, bất động sản, tiền điện tử, quỹ khẩn cấp, v.v.
zh_cn: 储蓄、股票、基金、房地产、加密货币、应急基金等。

# oXnjbh
source: Debt Payment
ja_jp: 債務返済
ko_kr: 부채 상환
vi_vn: Trả nợ
zh_cn: 债务偿还

# yJZOmD
source: Bank loan payments, credit cards, personal debts, etc.
ja_jp: 銀行ローン返済、クレジットカード、個人債務など。
ko_kr: 은행 대출 상환, 신용카드, 개인 부채 등
vi_vn: Thanh toán khoản vay ngân hàng, thẻ tín dụng, nợ cá nhân, v.v.
zh_cn: 银行贷款还款、信用卡、个人债务等。

# flIwoN
source: Other Expenses
ja_jp: その他の支出
ko_kr: 기타 지출
vi_vn: Chi tiêu khác
zh_cn: 其他费用

# r3fFt1
source: Unexpected repairs, fines, losses, unidentified expenses, etc.
ja_jp: 予期しない修理、罰金、損失、未確認の支出など。
ko_kr: 예상치 못한 수리, 벌금, 손실, 미확인 지출 등
vi_vn: Sửa chữa bất ngờ, tiền phạt, mất mát, chi tiêu không xác định, v.v.
zh_cn: 意外维修、罚款、损失、不明支出等。

# t8QlFE
source: January
ja_jp: 1月
ko_kr: 1월
vi_vn: Tháng 1
zh_cn: 一月

# 0TR0PD
source: February
ja_jp: 2月
ko_kr: 2월
vi_vn: Tháng 2
zh_cn: 二月

# T5W0CV
source: March
ja_jp: 3月
ko_kr: 3월
vi_vn: Tháng 3
zh_cn: 三月

# h7xti1
source: April
ja_jp: 4月
ko_kr: 4월
vi_vn: Tháng 4
zh_cn: 四月

# zUpHdf
source: May
ja_jp: 5月
ko_kr: 5월
vi_vn: Tháng 5
zh_cn: 五月

# xBaHKe
source: June
ja_jp: 6月
ko_kr: 6월
vi_vn: Tháng 6
zh_cn: 六月

# NGWumB
source: July
ja_jp: 7月
ko_kr: 7월
vi_vn: Tháng 7
zh_cn: 七月

# lINtN6
source: August
ja_jp: 8月
ko_kr: 8월
vi_vn: Tháng 8
zh_cn: 八月

# TFf5u+
source: September
ja_jp: 9月
ko_kr: 9월
vi_vn: Tháng 9
zh_cn: 九月

# EuK7yR
source: October
ja_jp: 10月
ko_kr: 10월
vi_vn: Tháng 10
zh_cn: 十月

# pn+jQD
source: November
ja_jp: 11月
ko_kr: 11월
vi_vn: Tháng 11
zh_cn: 十一月

# SsiZK7
source: December
ja_jp: 12月
ko_kr: 12월
vi_vn: Tháng 12
zh_cn: 十二月

# MsWwGp
source: Password must have at least 8 characters, including uppercase, lowercase, number and special character.
ja_jp: パスワードは、大文字、小文字、数字、特殊文字を含む少なくとも8文字である必要があります。
ko_kr: 비밀번호는 최소 8자 이상이어야 하며 대문자, 소문자, 숫자 및 특수 문자를 포함해야 합니다.
vi_vn: Mật khẩu phải có ít nhất 8 ký tự, bao gồm chữ hoa, chữ thường, số và ký tự đặc biệt.
zh_cn: 密码必须至少包含 8 个字符，包括大写字母、小写字母、数字和特殊字符。

# /1byDa
source: Amount is required.
ja_jp: 金額は必須です。
ko_kr: 금액은 필수입니다.
vi_vn: Số tiền là bắt buộc.
zh_cn: 必须填写金额。

# HCzfe9
source: Amount must be a valid number.
ja_jp: 金額は有効な数値である必要があります。
ko_kr: 금액은 유효한 숫자여야 합니다.
vi_vn: Số tiền phải là một số hợp lệ.
zh_cn: 金额必须是有效数字。

# ICgNGL
source: Amount must be greater than 0.
ja_jp: 金額は0より大きい必要があります。
ko_kr: 금액은 0보다 커야 합니다.
vi_vn: Số tiền phải lớn hơn 0.
zh_cn: 金额必须大于 0。

# 9I9BOz
source: Maximum amount is 100 billion.
ja_jp: 最大金額は1000億です。
ko_kr: 최대 금액은 1000억입니다.
vi_vn: Số tiền tối đa là 100 tỷ.
zh_cn: 最大金额为 1000 亿。

# aAADUG
source: Username is required.
ja_jp: ユーザー名は必須です。
ko_kr: 사용자 이름은 필수입니다.
vi_vn: Tên đăng nhập là bắt buộc.
zh_cn: 必须填写用户名。

# gpW0lx
source: Current password is required.
ja_jp: 現在のパスワードは必須です。
ko_kr: 현재 비밀번호는 필수입니다.
vi_vn: Mật khẩu hiện tại là bắt buộc.
zh_cn: 必须填写当前密码。

# 136ad6
source: Please confirm your new password.
ja_jp: 新しいパスワードを確認してください。
ko_kr: 새 비밀번호를 확인해주세요.
vi_vn: Vui lòng xác nhận mật khẩu mới của bạn.
zh_cn: 请确认您的新密码。

# H5adYw
source: Passwords do not match.
ja_jp: パスワードが一致しません。
ko_kr: 비밀번호가 일치하지 않습니다.
vi_vn: Mật khẩu không khớp.
zh_cn: 密码不匹配。

# RKK2dE
source: Enter the 6-digit code from your authenticator app.
ja_jp: 認証アプリから6桁のコードを入力してください。
ko_kr: 인증 앱의 6자리 코드를 입력하세요.
vi_vn: Nhập mã 6 chữ số từ ứng dụng xác thực của bạn.
zh_cn: 输入您的身份验证器应用中的 6 位代码。

# eX6daX
source: Code must be at most 10 digits.
ja_jp: コードは最大10桁である必要があります。
ko_kr: 코드는 최대 10자리 숫자여야 합니다.
vi_vn: Mã phải có tối đa 10 chữ số.
zh_cn: 代码最多为 10 位数字。

# O4PhlQ
source: Code can only contain digits.
ja_jp: コードには数字のみ使用できます。
ko_kr: 코드는 숫자만 포함할 수 있습니다.
vi_vn: Mã chỉ có thể chứa các chữ số.
zh_cn: 代码只能包含数字。

# /4pQDl
source: Name is required.
ja_jp: 名前は必須です。
ko_kr: 이름은 필수입니다.
vi_vn: Tên là bắt buộc.
zh_cn: 必须填写姓名。

# YeRtBx
source: Name must be at most 100 characters.
ja_jp: 名前は最大100文字です。
ko_kr: 이름은 최대 100자입니다.
vi_vn: Tên phải có tối đa 100 ký tự.
zh_cn: 姓名最多为 100 个字符。

# c+1x/V
source: Username must have at least 3 characters.
ja_jp: ユーザー名は少なくとも3文字である必要があります。
ko_kr: 사용자 이름은 최소 3자 이상이어야 합니다.
vi_vn: Tên đăng nhập phải có ít nhất 3 ký tự.
zh_cn: 用户名必须至少包含 3 个字符。

# MSqoQ2
source: Username must be at most 30 characters.
ja_jp: ユーザー名は最大30文字です。
ko_kr: 사용자 이름은 최대 30자입니다.
vi_vn: Tên đăng nhập phải có tối đa 30 ký tự.
zh_cn: 用户名最多为 30 个字符。

# 8Y5qyI
source: Username can only contain letters, numbers, underscores, and dots.
ja_jp: ユーザー名には、文字、数字、アンダースコア、ドットのみ使用できます。
ko_kr: 사용자 이름은 문자, 숫자, 밑줄 및 점만 포함할 수 있습니다.
vi_vn: Tên đăng nhập chỉ có thể chứa chữ cái, số, dấu gạch dưới và dấu chấm.
zh_cn: 用户名只能包含字母、数字、下划线和点。

# GNwfGD
source: Please select a transaction type.
ja_jp: 取引タイプを選択してください。
ko_kr: 거래 유형을 선택해주세요.
vi_vn: Vui lòng chọn loại giao dịch.
zh_cn: 请选择交易类型。

# uDAfoc
source: Category is required.
ja_jp: カテゴリは必須です。
ko_kr: 카테고리는 필수입니다.
vi_vn: Danh mục là bắt buộc.
zh_cn: 必须填写分类。

# 2saJxm
source: Please select a currency.
ja_jp: 通貨を選択してください。
ko_kr: 통화를 선택해주세요.
vi_vn: Vui lòng chọn một loại tiền tệ.
zh_cn: 请选择货币。

# be3kp3
source: Description is required.
ja_jp: 説明は必須です。
ko_kr: 설명은 필수입니다.
vi_vn: Mô tả là bắt buộc.
zh_cn: 必须填写说明。

# Y1VHB3
source: Description must be at most 200 characters.
ja_jp: 説明は最大200文字です。
ko_kr: 설명은 최대 200자입니다.
vi_vn: Mô tả phải có tối đa 200 ký tự.
zh_cn: 描述最多为 200 个字符。

# MhMNy6
source: Please select a date.
ja_jp: 日付を選択してください。
ko_kr: 날짜를 선택해주세요.
vi_vn: Vui lòng chọn ngày.
zh_cn: 请选择日期。

# EtmyBh
source: Please select a type.
ja_jp: タイプを選択してください。
ko_kr: 유형을 선택해주세요.
vi_vn: Vui lòng chọn một loại.
zh_cn: 请选择类型。

# 5huJG4
source: Category name is required.
ja_jp: カテゴリ名は必須です。
ko_kr: 카테고리 이름은 필수입니다.
vi_vn: Tên danh mục là bắt buộc.
zh_cn: 必须填写分类名称。

# LmVuiu
source: Category name must be at most 50 characters.
ja_jp: カテゴリ名は最大50文字です。
ko_kr: 카테고리 이름은 최대 50자입니다.
vi_vn: Tên danh mục phải có tối đa 50 ký tự.
zh_cn: 分类名称最多为 50 个字符。

# HxXJtm
source: Please select a start date.
ja_jp: 開始日を選択してください。
ko_kr: 시작일을 선택해주세요.
vi_vn: Vui lòng chọn ngày bắt đầu.
zh_cn: 请选择开始日期。

# O3egh+
source: Please select an end date.
ja_jp: 終了日を選択してください。
ko_kr: 종료일을 선택해주세요.
vi_vn: Vui lòng chọn ngày kết thúc.
zh_cn: 请选择结束日期。

# hjtyTg
source: End date must be after start date.
ja_jp: 終了日は開始日より後である必要があります。
ko_kr: 종료일은 시작일 이후여야 합니다.
vi_vn: Ngày kết thúc phải sau ngày bắt đầu.
zh_cn: 结束日期必须在开始日期之后。

# eEFyJl
source: Goal name is required.
ja_jp: 目標名は必須です。
ko_kr: 목표 이름은 필수입니다.
vi_vn: Tên mục tiêu là bắt buộc.
zh_cn: 必须填写目标名称。

# qVUStI
source: Goal name must be at most 100 characters.
ja_jp: 目標名は最大100文字です。
ko_kr: 목표 이름은 최대 100자입니다.
vi_vn: Tên mục tiêu phải có tối đa 100 ký tự.
zh_cn: 目标名称最多为 100 个字符。

# tb8z8V
source: Please select a frequency.
ja_jp: 頻度を選択してください。
ko_kr: 빈도를 선택해주세요.
vi_vn: Vui lòng chọn tần suất.
zh_cn: 请选择频率。

# BErLOD
source: Please enter the number of days.
ja_jp: 日数を入力してください。
ko_kr: 일수를 입력해주세요.
vi_vn: Vui lòng nhập số ngày.
zh_cn: 请输入天数。

# N4OgtE
source: The number of days must not exceed 365.
ja_jp: 日数は365を超えてはいけません。
ko_kr: 일수는 365를 초과할 수 없습니다.
vi_vn: Số ngày không được vượt quá 365.
zh_cn: 天数不能超过 365。

# F8BDEm
source: Cannot activate a recurring transaction that has already expired.
ja_jp: 既に期限切れの定期取引を有効化することはできません。
ko_kr: 이미 만료된 반복 거래는 활성화할 수 없습니다.
vi_vn: Không thể kích hoạt giao dịch định kỳ đã hết hạn.
zh_cn: 无法激活已过期的定期交易。
